app/Advisory.php

select * from `cars` where `cars`.`id` = '1' limit 1
---
    public function getCar()
    {
        $advisory = Car::find($this->car_id);