app/Car.php

select * from `company` where `company`.`id` = '4' limit 1
---
    public function getCompany()
    {
        $companys = Company::find($this->comp_id);

select * from `car_type` where `car_type`.`id` = '3' limit 1
---
    public function getCarType()
    {
        $car_type = CarType::find($this->type_id);

select * from `cars` where `cars`.`id` = '1' limit 1
---
    public function getImageCar()
    {
        $car = Car::find($this->id);