app/Category.php

select * from `categories` where `categories`.`id` = '-1' limit 1
---
    public function getParentName()
    {
    	$parent = self::find($this->parent_id);