app/Post.php

select * from `categories` where `categories`.`id` = '5' limit 1
---
    public function getCate()
    {
        $category = Category::find($this->category_id);

select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function getImagePost()
    {
        $post = Post::find($this->id);