app/User.php

select * from `roles` where `roles`.`id` = '900' limit 1
---
    public function getRole()
    {
        $users = Role::find($this->roles);