app/Http/Controllers/HomeController.php

select * from `company`
---
    public function newcar()
    {
        $companys = Company::all();

select * from `cars` where `comp_id` = '3' and `car_year` = '2018' and `status` = 'Public'
select * from `image_car` where `car_id` = '7' limit 1
---
    public function getNewCar(Request $request)
    {
        $getcar = Car::where('comp_id', $request->id_company)->where('car_year', Carbon::now()->year)->where('status', 'Public')->get();
        foreach ($getcar as $imgCar) {
            $imgCar['img'] = $imgCar->getImageCar()->first();

select * from `company`
---
    public function usedcar()
    {
        $companys = Company::all();

select * from `cars` where `id` = '4' limit 1
select `id` from `vehicles` where `car_id` = '4'
select * from `operates` where `vehicle_id` = '3' limit 1
select * from `colors` where `id` = '2' limit 1
select * from `engines` where `vehicle_id` = '3' limit 1
select * from `exteriors` where `vehicle_id` = '3' limit 1
select * from `sizes` where `vehicle_id` = '3' limit 1
select * from `car_type` where `id` = '4' limit 1
select * from `company` where `id` = '4' limit 1
select * from `image_car` where `car_id` = '4'
---
    public function detail_car(Request $request, $id)
    {
        $detail_car = Car::where('id', $id)->first();
        $id_vehicle = Vehicle::where('car_id', $id)->pluck('id')->first();
        $operates = Operate::where('vehicle_id', $id_vehicle)->first();
        $colors = Color::where('id', $detail_car->color_id)->first();
        $engines = Engine::where('vehicle_id', $id_vehicle)->first();
        $exteriors = Exterior::where('vehicle_id', $id_vehicle)->first();
        $sizes = Size::where('vehicle_id', $id_vehicle)->first();
        $car_type = CarType::where('id', $id)->first();
        $companys = Company::where('id', $id)->first();
        $images = ImageCar::where('car_id', $id)->get();

select * from `categories` where `status` = 'Public' and `parent_id` = '-1'
select count(*) as aggregate from `posts` where `status` = 'Public'
---
    public function news()
    {
        $parent_categories = Category::where('status', 'Public')->where('parent_id', -1)->get();
        $posts = Post::where('status', 'Public')->paginate(config('app.paginate'));

select * from `cars` where `status` = 'Public' limit 12 offset 0
select count(*) as aggregate from `cars` where `status` = 'Public'
select * from `image_car` where `car_id` = '1' limit 1
---
    public function compare()
    {
        $compare = Car::where('status', 'Public')->paginate(config('app.paginate'));
            foreach ($compare as $imgCar) {
            $imgCar['img'] = $imgCar->getImageCar()->first();

select * from `cars` where `id` = '3' limit 1
select * from `image_car` where `car_id` = '3' limit 1
select * from `car_type` where `id` = '2' limit 1
select * from `company` where `id` = '3' limit 1
select * from `colors` where `id` = '3' limit 1
select `id` from `vehicles` where `car_id` = '3'
select * from `operates` where `vehicle_id` = '3' limit 1
select * from `engines` where `vehicle_id` = '3' limit 1
select * from `exteriors` where `vehicle_id` = '3' limit 1
select * from `sizes` where `vehicle_id` = '3' limit 1
---
    public function compareAdd(Request $request)
    {
        $cars = Car::where('id', $request->compare_id)->first();
        $img = ImageCar::where('car_id', $cars->id)->first();
        $type = CarType::where('id', $cars->type_id)->first();
        $company = Company::where('id', $cars->comp_id)->first();
        $color = Color::where('id', $cars->color_id)->first();
        $id_vehicle = Vehicle::where('car_id', $cars->id)->pluck('id')->first();
        $operates = Operate::where('vehicle_id', $id_vehicle)->first();
        $engines = Engine::where('vehicle_id', $id_vehicle)->first();
        $exteriors = Exterior::where('vehicle_id', $id_vehicle)->first();
        $sizes = Size::where('vehicle_id', $id_vehicle)->first();

select * from `posts` where `slug` = 't-sportline-tung-goi-do-cuc-dinh-danh-rieng-cho-tesla-model-x-20180605072818352' limit 1
select * from `image_post` where `post_id` = '23'
select * from `posts` where `slug` = 'phpadmin' limit 1
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` = '23'
---
    public function detail($slug)
    {
        $post = Post::where('slug', $slug)->first();
        $images = ImagePost::where('post_id', $post->id)->get();
        $post['tags'] = $post->tags()->get();