app/Repositories/Eloquents/SearchingRepository.php

    public function searchPost(array $attributes)
    {
        if (!$attributes['keyword']) {

            return redirect(route('homepage'));
        }
        $keyword = $attributes['keyword'];
        $posts = Post::where('status', 'Public')
                        ->where('title', 'like', "%$keyword%")
                        ->paginate(config('app.paginate'));
---
select count(*) as aggregate from `posts` where `status` = 'Public' and `title` like '%a%'