app/Http/Controllers/Admin/CarTypeController.php

    public function getCarType(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $types = CarType::paginate($pageSize);
---
select * from `car_type` limit 5 offset 0
select count(*) as aggregate from `car_type`

    public function checkName(Request $request)
    {
        $type = CarType::where('type', $request->name)->first();
---
select * from `car_type` where `type` = 'asaldash' limit 1