app/Http/Controllers/Admin/CategoryController.php

    public function getCate(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $category = Category::paginate($pageSize);
---
select * from `categories` limit 5 offset 0
select count(*) as aggregate from `categories`

    public function add()
    {
        $model = new Category();
        $status = 'UnPublic';
        $cates = Category::all();
---
select * from `categories`

    public function checkName(Request $request)
    {
        $cate = Category::where('category_name', $request->name)->first();
---
select * from `categories` where `category_name` = 'Xe Audi' limit 1

    public function save(Request $request)
    {
        if ($request->id) {
    	   $model = Category::find($request->id);
---
select * from `categories` where `categories`.`id` = '4' limit 1

    public function edit($id)
    {
    	$model = Category::find($id);
        $select = [];
        $select = ['-1' => '-----------------------------'];
        if (!$model) {
            return view('user.admin.404');
        } else {
            $cates = Category::all();
---
select * from `categories` where `categories`.`id` = '4' limit 1
select * from `categories`