app/Http/Controllers/Admin/ColorController.php

    public function getColor(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $colors = Color::paginate($pageSize);
---
select * from `colors` limit 5 offset 0
select count(*) as aggregate from `colors`

    public function checkName(Request $request)
    {
        $color = Color::where('color', $request->name)->first();
---
select * from `colors` where `color` = 'aljafjasf' limit 1

    public function save(Request $request)
    {
        if ($request->id) {
        $model = Color::find($request->id);
            if (!$model) {
                return view('user.admin.404');
            }
        } else {
            $model = new Color();
        }
        $model->fill($request->all());
        $model->save();
---
select * from `colors` where `colors`.`id` = '7' limit 1
insert into `colors` (`updated_at`, `created_at`) values ('2018-06-08 03:27:16', '2018-06-08 03:27:16')
update `colors` set `color` = 'Pink', `updated_at` = '2018-06-08 03:30:13' where `id` = '7'

    public function edit($id)
    {
     $model = Color::find($id);
---
select * from `colors` where `colors`.`id` = '3' limit 1