app/Http/Controllers/Admin/CompanyController.php

    public function getCompany(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $companys = Company::paginate($pageSize);
---
select * from `company` limit 5 offset 0
select count(*) as aggregate from `company`

    public function checkName(Request $request)
    {
        $company = Company::where('com_name', $request->name)->first();
---
select * from `company` where `com_name` = 'Dol' limit 1

    public function save(Request $request)
    {
        if ($request->id) {
        $model = Company::find($request->id);
            if (!$model) {
                return view('user.admin.404');
            }
        } else {
            $model = new Company();
        }
        $model->fill($request->all());
        $model->save();
---
insert into `company` (`com_name`, `com_add`, `com_phone`, `updated_at`, `created_at`) values ('', '', '', '2018-06-08 04:01:04', '2018-06-08 04:01:04')

    public function remove($id)
    {
     $company = Company::find($id);
        if (!$company) {
            return view('user.admin.404');
        } else {
            $company->delete();
---
select * from `company` where `company`.`id` = '11' limit 1
delete from `company` where `id` = '11'