app/Http/Controllers/Admin/OrderController.php

select * from `advisory` limit 5 offset 0
select count(*) as aggregate from `advisory`
---
    public function getOrders(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $advisorys = Advisory::paginate($pageSize);

select * from `advisory` where `advisory`.`id` = '2' limit 1
select * from `cars` where `cars`.`id` = '7' limit 1
select * from `colors` where `id` = '3' limit 1
select * from `car_type` where `id` = '2' limit 1
select * from `company` where `id` = '3' limit 1
---
    public function edit($id)
    {
        $advisory = Advisory::find($id);
        if (!$advisory) {
            return view('user.admin.404');
        } else {
            $checked = $advisory->status;
            $car = Car::find($advisory->car_id);
            $colors = Color::where('id', $car->color_id)->first();
            $types = CarType::where('id', $car->type_id)->first();
            $companys = Company::where('id', $car->comp_id)->first();