app/Http/Controllers/Admin/PostController.php

    public function getPost(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if(!$keyword) {
            $posts = Post::paginate($pageSize);
            $addPath .= "?pagesize=$pageSize";
            foreach ($posts as $p) {
                $p['category_name'] = $p->getCate();
                $p['images'] = $p->getImagePost()->first();
---
select * from `posts` limit 5 offset 0
select count(*) as aggregate from `posts`
select * from `image_post` where `post_id` = '1' limit 1

    public function show($id)
    {
        $detail_post = Post::find($id);
        if (!$detail_post) {
            return view('user.admin.404');
        } else {
            $detail_post['tags'] = $detail_post->tags()->get();
            $images = ImagePost::where('post_id', $id)->get();
            $category = Category::where('id', $detail_post->category_id)->first();
---
select * from `posts` where `posts`.`id` = '23' limit 1
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` = '23'
select * from `image_post` where `post_id` = '23'
select * from `categories` where `id` = '4' limit 1