app/Http/Controllers/Admin/ProductController.php

select * from `cars` limit 5 offset 0
select count(*) as aggregate from `cars`
select * from `image_car` where `car_id` = '1' limit 1
---
    public function getProduct(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 5 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $products = Car::paginate($pageSize);
            $addPath .= "?pagesize=$pageSize";
            foreach ($products as $product) {
                $product['car_type'] = $product->getCarType();
                $product['companys'] = $product->getCompany();
                $product['images'] = $product->getImageCar()->get();

select * from `cars` where `cars`.`id` = '1' limit 1
select `id` from `vehicles` where `car_id` = '1'
select * from `operates` where `vehicle_id` = '5' limit 1
select * from `colors` where `id` = '1' limit 1
select * from `engines` where `vehicle_id` = '5' limit 1
select * from `exteriors` where `vehicle_id` = '5' limit 1
select * from `sizes` where `vehicle_id` = '5' limit 1
select * from `car_type` where `id` = '1' limit 1
select * from `company` where `id` = '1' limit 1
select * from `image_car` where `car_id` = '1'
---
    public function show($id)
    {
        $detail_car = Car::find($id);
        if (!$detail_car) {
            return view('user.admin.404');
        } else {
            $id_vehicle = Vehicle::where('car_id', $id)->pluck('id')->first();
            $operates = Operate::where('vehicle_id', $id_vehicle)->first();
            $colors = Color::where('id', $detail_car->color_id)->first();
            $engines = Engine::where('vehicle_id', $id_vehicle)->first();
            $exteriors = Exterior::where('vehicle_id', $id_vehicle)->first();
            $sizes = Size::where('vehicle_id', $id_vehicle)->first();
            $car_type = CarType::where('id', $id)->first();
            $companys = Company::where('id', $id)->first();
            $images = ImageCar::where('car_id', $id)->get();

select * from `car_type`
select * from `company`
select * from `colors`
---
    public function add(Car $car, Vehicle $vehicle, Operate $operates, Engine $engines, Exterior $exteriors, Size $sizes)
    {
        $status = $car->status;
        $car_types = CarType::all();
        $types = [];
        $typed = $car->type_id;
            foreach ($car_types as $type) {
                $types[$type->id] = $type->type;
            }

        $car_companys = Company::all();
        $car_company = [];
        $companyed = $car->comp_id;
            foreach ($car_companys as $company) {
                $car_company[$company->id] = $company->com_name;
            }

        $car_colors = Color::all();

select * from `cars` where `car_name` is null limit 1
---
    public function checkName(Request $request)
    {
        $car = Car::where('car_name', $request->car_name)->first();

select * from `cars` where `cars`.`id` = '3' limit 1
select * from `vehicles` where `vehicles`.`id` = '3' limit 1
select `id` from `vehicles` where `car_id` = '3'
select * from `operates` where `vehicle_id` = '1' limit 1
---
    public function save(Request $request)
    {
        if ($request->id) {
           $car = Car::find($request->id);
            if (!$car) {
                return view('user.admin.404');
            }
        } else {
            $car = new Car();
            $car->type_id = $request->type;
            $car->comp_id = $request->com_name;
            $car->color_id = $request->color;
            $car->status = $request->status;
        }
        $car->fill($request->all());
        $car->save();

        if ($request->id) {
           $vehicle = Vehicle::find($request->id);
            if (!$vehicle) {
                return view('user.admin.404');
            }
        } else {
            $vehicle = new Vehicle();
            $vehicle->car_id = $car->id;
        }
        $vehicle->fill($request->all());
        $vehicle->save();

        if ($request->id) {
            $id_vehicle = Vehicle::where('car_id', $request->id)->pluck('id')->first();
            $operates = Operate::where('vehicle_id', $id_vehicle)->first();

select `id` from `vehicles` where `car_id` = '3'
select * from `engines` where `vehicle_id` = '1' limit 1
---
        $operates->save();

        if ($request->id) {
            $id_vehicle = Vehicle::where('car_id', $request->id)->pluck('id')->first();
            $engines = Engine::where('vehicle_id', $id_vehicle)->first();

select `id` from `vehicles` where `car_id` = '3'
select * from `exteriors` where `vehicle_id` = '1' limit 1
---
        $engines->save();

        if ($request->id) {
            $id_vehicle = Vehicle::where('car_id', $request->id)->pluck('id')->first();
            $exteriors = Exterior::where('vehicle_id', $id_vehicle)->first();

select `id` from `vehicles` where `car_id` = '3'
select * from `sizes` where `vehicle_id` = '1' limit 1
---
        $exteriors->save();

        if ($request->id) {
            $id_vehicle = Vehicle::where('car_id', $request->id)->pluck('id')->first();
            $sizes = Size::where('vehicle_id', $id_vehicle)->first();

select * from `cars` where `cars`.`id` = '8' limit 1
select * from `car_type`
select * from `company`
select * from `colors`
select `id` from `vehicles` where `car_id` = '8'
select * from `operates` where `vehicle_id` = '8' limit 1
select * from `engines` where `vehicle_id` = '8' limit 1
select * from `exteriors` where `vehicle_id` = '8' limit 1
select * from `sizes` where `vehicle_id` = '8' limit 1
select * from `image_car` where `car_id` = '8'
---
    public function edit($id)
    {
        $car = Car::find($id);
        $car_types = CarType::all();
        $types = [];
        $car_companys = Company::all();
        $car_company = [];
        $car_colors = Color::all();
        $car_color = [];
        if (!$car) {
            return view('user.admin.404');
        } else {
            $id_vehicle = Vehicle::where('car_id', $id)->pluck('id')->first();
            $operates = Operate::where('vehicle_id', $id_vehicle)->first();
            $engines = Engine::where('vehicle_id', $id_vehicle)->first();
            $exteriors = Exterior::where('vehicle_id', $id_vehicle)->first();
            $sizes = Size::where('vehicle_id', $id_vehicle)->first();
            $images = ImageCar::where('car_id', $id)->get();