app/Http/Controllers/Admin/UserController.php

select * from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function getUsers(Request $request)
    {
        $keyword = $request->keyword;
        $fullUrl = $request->fullUrl();
        $pageSize = $request->pagesize == null ? 10 : $request->pagesize;
        $addPath = "";
        if (!$keyword) {
            $users = User::paginate($pageSize);